{
   "comment":
      [
         "Defaults for CCI-P ports."
      ],

   "comment":
      [
         "Masks of request classes supported by the platform.",
         "The required enumeration is defined in ccip_cfg_pkg.sv"
      ],
   "c0-supported-reqs": "(C0_REQ_RDLINE_S | C0_REQ_RDLINE_I)",
   "c1-supported-reqs": "(C1_REQ_WRLINE_S | C1_REQ_WRLINE_I | C1_REQ_WRFENCE | C1_REQ_INTR)",

   "comment":
      [
         "Boolean (0/1) properties of whether each virtual channel",
         "is supported by the platform, indexed by t_ccip_vc."
      ],
   "vc-supported": "{ 1, 1, 1, 1 }",

   "comment":
      [
         "Boolean (0/1) properties of whether each possible request size",
         "is supported by the platform, indexed by t_ccip_clLen."
      ],
   "cl-len-supported": "{ 1, 1, 0, 1 }",

   "comment":
      [
         "Boolean (0/1) indicating whether the platform supports byte-enable",
         "to update only a portion of a cache line."
      ],
   "byte-en-supported": 0,

   "comment":
      [
         "Minimum number of outstanding lines that must be in flight to",
         "saturate bandwidth on each virtual channel.  (Index of the parameter",
         "is the virtual channel number.)  Maximum bandwidth is typically a",
         "function of the number lines in flight, indepent of request sizes."
      ],
   "max-bw-active-lines-c0": "{ 512, 512, 256, 256 }",
   "max-bw-active-lines-c1": "{ 512, 256, 128, 128 }",

   "max-outstanding-mmio-rd-reqs": 64,

   "comment":
      [
         "CCI-P requires that an AFU register both the request and response",
         "signals before any combinational logic.  We expect that this value",
         "will be 1 on all platforms, reflecting the expectation that an AFU",
         "will register CCI-P Tx and Rx signals according to the CCI-P spec."
      ],
   "suggested-timing-reg-stages": 1,

   "comment":
      [
         "add-timing-reg-stages is a request by the AFU to the platform to",
         "insert register stages on behalf of the AFU between the partial",
         "reconfiguration (PR) boundary and the AFU.  An AFU may set this to",
         "1 in order to satisfy the CCI-P buffering required by the spec.",
         "",
         "When there is also a clock crossing, using 'clock' below, the",
         "timing register stages are added between the clock crossing and",
         "the AFU.  In addition, extra space is allocated in the clock",
         "crossing FIFO to accommodate more CCI-P requests following an",
         "almost full signal due to the latency of the extra pipeline stages.",
         "",
         "Be careful when requesting more than a single stage if there is",
         "no clock crossing requested.  Extra register stages may lead to",
         "overruns due to late detection of almost full signals."
      ],
   "add-timing-reg-stages": 0,

   "comment":
      [
         "AFUs may request that the platform transform the CCI-P clock",
         "to a different clock domain by setting this value to the",
         "name of another incoming clock.  Only CCI-P clocks may be",
         "chosen. (E.g. pClkDiv2 or uClk_usr.)"
      ],
   "clock": "default"
}
