{
   "comment":
      [
         "Defaults for local memory ports."
      ],

   "comment":
      [
         "These properties all apply to a single bank.  It is assumed that",
         "all banks are configured identically."
      ],
   "addr-width": 26,
   "data-width": 512,
   "burst-cnt-width": 7,

   "comment":
      [
         "Like the same field in CCI-P, this is the recommended number",
         "of times an AFU should register local memory signals before use",
         "in order to make successful timing closure likely.",
         "",
         "When a local memory clock crossing is also requested, using",
         "the 'clock' parameter below, at least the suggested number of",
         "timing register stages are always inserted between the clock",
         "crossing and the AFU.  This is done because adding registers",
         "along with a clock crossing is relatively inexpensive.  See",
         "'add-timing-reg-stages' below for more detail."
      ],
   "suggested-timing-reg-stages": 0,

   "comment":
      [
         "Like the CCI-P add-timing-reg-stages, this field requests",
         "that the platform add pipeline stages to the local memory",
         "signals before passing them to the AFU.",
         "",
         "Register stages are added using one of two methods.  When",
         "a clock crossing is also requested for local memory, using",
         "the 'clock' parameter below, register stages are added as",
         "a simple, synchronous pipeline.  This is possible, despite",
         "the Avalon waitrequest protocol, because space is left in",
         "the clock crossing FIFO to drain the pipeline without losing",
         "requests, even after waitrequest is asserted.  When no clock",
         "crossing is requested, stages are added using an Avalon MM",
         "pipeline bridge."
      ],
   "add-timing-reg-stages": 0,

   "comment":
      [
         "By default, each memory bank has its own clock which may be",
         "independent of all other clocks.  Since converting CCI-P and",
         "memory signals to the same clock domain is a common idiom,",
         "the clock domain of all memory banks may be converted to a",
         "specific clock here by setting 'clock' to a string that matches",
         "the name of any CCI-P clock.  Memory reset signals are",
         "also converted to the requested clock domain.",
         "",
         "Only CCI-P clocks may be chosen. (E.g. pClkDiv2 or uClk_usr.)"
      ],
   "clock": "default"
}
